#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform

data.archive_file.zip_the_python_code: Reading...
data.aws_db_instance.tc_pg_db: Reading...
data.aws_iam_role.labrole: Reading...
data.aws_security_group.rds_sg: Reading...
data.aws_vpc.vpc: Reading...
data.aws_iam_role.labrole: Read complete after 0s [id=LabRole]
data.archive_file.zip_the_python_code: Read complete after 0s [id=d3a12e18d7a3911d62772bff35be82b4e62eb162]
data.aws_vpc.vpc: Read complete after 1s [id=vpc-01a81d790ce674a4c]
data.aws_subnets.subnets: Reading...
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]
data.aws_subnet.subnet["subnet-047b1bbff831ba7cb"]: Reading...
data.aws_subnet.subnet["subnet-0c46fb968ff90f792"]: Reading...
data.aws_subnet.subnet["subnet-0c9fefacbcd198b0b"]: Reading...
data.aws_subnet.subnet["subnet-06345c13c20b7c9ae"]: Reading...
data.aws_subnet.subnet["subnet-0c46fb968ff90f792"]: Read complete after 0s [id=subnet-0c46fb968ff90f792]
data.aws_subnet.subnet["subnet-047b1bbff831ba7cb"]: Read complete after 0s [id=subnet-047b1bbff831ba7cb]
data.aws_subnet.subnet["subnet-06345c13c20b7c9ae"]: Read complete after 0s [id=subnet-06345c13c20b7c9ae]
data.aws_subnet.subnet["subnet-0c9fefacbcd198b0b"]: Read complete after 0s [id=subnet-0c9fefacbcd198b0b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_cloudwatch_event_rule.every_15_minutes will be created
  + resource "aws_cloudwatch_event_rule" "every_15_minutes" {
      + arn                 = (known after apply)
      + description         = "trigger lambda every 15 minute"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "every_15_minutes_rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(15 minutes)"
      + tags_all            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @BrunaPisera, Action: `pull_request`*